# SweepProfile Class

---
Represents a profile for sweep or swept blend elements.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSweepProfile Autodesk.Revit.DBCurveLoopsProfile Autodesk.Revit.DBFamilySymbolProfile
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SweepProfile : APIObject

    Public Class SweepProfile
    	Inherits APIObject

    public ref class SweepProfile : public APIObject

    type SweepProfile =
        class
            inherit APIObject
        end
The SweepProfile type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace